#### Environment - `qa`
#### Terraform Format and Style - `success`
#### Terraform Initialization - `success`
#### Terraform Validation - `success`
#### Terraform Plan - `success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
envs/qa relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/conf-infra/conf-infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/conf-infra/conf-infra

To view this run in a browser, visit:
https://app.terraform.io/app/serhiimakogon/clarks-qa/runs/run-CZMvnyNUfdt5Lepv

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
module.governance_cluster.data.confluent_stream_governance_region.essentials: Reading...
module.governance_cluster.data.confluent_stream_governance_region.essentials: Read complete after 0s [id=sgreg-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_environment.qa will be created
  + resource "confluent_environment" "qa" {
      + display_name  = "qa"
      + id            = (known after apply)
      + resource_name = (known after apply)
    }

  # module.governance_cluster.confluent_stream_governance_cluster.essentials will be created
  + resource "confluent_stream_governance_cluster" "essentials" {
      + api_version   = (known after apply)
      + display_name  = (known after apply)
      + http_endpoint = (known after apply)
      + id            = (known after apply)
      + kind          = (known after apply)
      + package       = "ESSENTIALS"
      + resource_name = (known after apply)

      + environment {
          + id = (known after apply)
        }

      + region {
          + id = "sgreg-1"
        }
    }

  # module.kafka_cluster.confluent_kafka_cluster.basic will be created
  + resource "confluent_kafka_cluster" "basic" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AWS"
      + display_name       = (known after apply)
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "us-east-2"
      + rest_endpoint      = (known after apply)

      + basic {}

      + environment {
          + id = (known after apply)
        }

      + network {
          + id = (known after apply)
        }
    }

  # module.kafka_cluster.random_id.cluster_suffix will be created
  + resource "random_id" "cluster_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ksql_cluster.confluent_ksql_cluster.ksql will be created
  + resource "confluent_ksql_cluster" "ksql" {
      + api_version                 = (known after apply)
      + csu                         = 1
      + display_name                = (known after apply)
      + http_endpoint               = (known after apply)
      + id                          = (known after apply)
      + kind                        = (known after apply)
      + storage                     = (known after apply)
      + topic_prefix                = (known after apply)
      + use_detailed_processing_log = true

      + credential_identity {
          + id = (known after apply)
        }

      + environment {
          + id = (known after apply)
        }

      + kafka_cluster {
          + id = (known after apply)
        }
    }

  # module.ksql_cluster.confluent_role_binding.ksql_kafka_cluster_admin will be created
  + resource "confluent_role_binding" "ksql_kafka_cluster_admin" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = (known after apply)
      + role_name   = "CloudClusterAdmin"
    }

  # module.ksql_cluster.confluent_service_account.ksql will be created
  + resource "confluent_service_account" "ksql" {
      + api_version  = (known after apply)
      + description  = "Service account to manage ksqldb cluster"
      + display_name = "qa_ksql"
      + id           = (known after apply)
      + kind         = (known after apply)
    }

  # module.ksql_cluster.random_id.cluster_suffix will be created
  + resource "random_id" "cluster_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @serhiimakogon, Action: `pull_request`*